app/controllers/admin_controller.rb

SELECT count(*) AS count_all FROM "users"
INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password") VALUES('lynx_r', '-6153976880.575654784739493', '2010-08-24 17:28:35', '2010-08-24 17:28:35', 'ced2d72a9488f640aa1062848ffee133e8ca2e19')
---
  def login
    if request.post?
      if User.count.zero?
        user = User.create(:name => params[:name], :password => params[:password],
          :password_confirmation => params[:password_confirmation])

SELECT count(*) AS count_all FROM "orders"
---
  def index
    @total_orders = Order.count