app/controllers/posts_controller.rb

SELECT * FROM "posts"
---
  def news
    @posts = Post.all

SELECT * FROM "posts"
---
  def index
    @posts = Post.all

SELECT * FROM "posts" WHERE ("posts"."id" = 0)
---
  def show
    @post = Post.find(params[:id])

INSERT INTO "posts" ("created_at", "title", "body", "author", "updated_at") VALUES('2010-08-26 12:26:09', '', '', '', '2010-08-26 12:26:09')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save