app/controllers/products_controller.rb

SELECT * FROM "products"
---
  def index
    @products = Product.all

SELECT * FROM "products" WHERE ("products"."id" = 1)
---
  def show
    @product = Product.find(params[:id])

SELECT * FROM "products" WHERE ("products"."id" = 4)
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("price", "created_at", "title", "image_url", "updated_at", "description", "locale") VALUES(21.0, '2010-08-25 18:27:03', 'Книга без названия', '/images/kniga_bez_nazvaniya.jpg', '2010-08-25 18:27:03', 'Эта книга за несколько месяцев стала одной из самых обсуждаемых в сети Интернет. Издательства в разных странах выпускают ее огромными тиражами, но… имя автора остается неизвестным, а чтение "Книги без названия" стало для многих опасным и пугающим приключением.
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM "products" WHERE ("products"."id" = 4)
UPDATE "products" SET "updated_at" = '2010-08-26 08:48:33', "description" = '<p>Эта книга за несколько месяцев стала одной из самых обсуждаемых в сети Интернет. Издательства в разных странах выпускают ее огромными тиражами, но… имя автора остается неизвестным, а чтение "Книги без названия" стало для многих опасным и пугающим приключением.</p>' WHERE "id" = 6
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT * FROM "products" WHERE ("products"."id" = 5)
DELETE FROM "products" WHERE "id" = 5
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy