app/controllers/store_controller.rb

  def index
    @products = Product.find_products_for_sale
---
SELECT * FROM "products" ORDER BY title

  def add_to_cart
    session[:counter] = 0
    product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 3)

  def del_from_cart
    product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 3)

  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("product_id", "order_id", "quantity", "total_price", "created_at", "updated_at") VALUES(2, 1, 3, 83.07, '2010-08-29 09:42:47', '2010-08-29 09:42:47')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('Alex', 'Trosn', '2010-08-17 16:46:08', '2010-08-17 16:46:08', 'check', 'alex-86p@yandex.ru')