app/controllers/test_controller_controller.rb

SELECT * FROM "orders" WHERE ("orders"."name" = 'Jack R') LIMIT 1
---
  def create_order
    order = Order.find_by_name "Jack R"

SELECT * FROM "orders" WHERE ("orders"."name" = 'Jack R') LIMIT 1
---
  def create_html_order
    order = Order.find_by_name "Jack R"