app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password") VALUES('lynx_r', '-6165202280.272908662337132', '2010-08-24 08:13:40', '2010-08-24 08:13:40', 'a0a1114c29b26dad81c48225058b4961d5551b6b')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-08-30 15:49:56', "salt" = '-6160202980.376286148517132', "hashed_password" = '0cbbdcd5b8b466e2b0a4c19251174651bf77ef85', "name" = 'admin' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "users" WHERE "id" = 1
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy